import Recipe from "../models/recipes";

export const RECIPES = [
   new Recipe(
       "m1",
         "ต้มจืดไข่น้ำ",
        293,
        20,
         [ "100 กรัม", "3 ใบ", "1 ต้น", "1 ต้นเล็ก"],
        ["สันในไก่", "ผักกาดขาว", "ต้นหอม", "ผักชี"],
        ["เนื้อ", "ผัก", "ผัก", "ผัก"],
         [
            "หั่นผักทุกๆอย่างเตรียมไว้ทั้ง ผักกาดขาว ต้นหอม ผักชี",
            "นำสันในไก่มาหั่นเป็นชิ้นเล็กๆละเอียดแค่พอประมาณ จากนั้นใส่ลงถ้วยสำหรับผสม",
            "ปรุงรสไก่สับด้วยพริกไทยดำ น้ำตาลทรายแดงแบบไม่ผ่านกระบวนการ เกลือและซีอิ้วขาวเล็กน้อย",
            "ตอกไข่และตีผสมให้เข้ากัน ปรุงรสเล็กน้อยด้วยซีอิ้วขาว"
        ],
        "https://www.lovefitt.com/system/wp-content/uploads/2013/07/diet-0036.jpg",
        "https://www.lovefitt.com/diet-menu/%E0%B8%95%E0%B9%89%E0%B8%A1%E0%B8%88%E0%B8%B7%E0%B8%94%E0%B9%84%E0%B8%82%E0%B9%88%E0%B8%99%E0%B9%89%E0%B8%B3-%E0%B9%80%E0%B8%A1%E0%B8%99%E0%B8%B9%E0%B8%97%E0%B8%B3%E0%B8%87%E0%B9%88%E0%B8%B2%E0%B8%A2-%E0%B9%80%E0%B8%AD%E0%B8%B2%E0%B9%83%E0%B8%88%E0%B8%84%E0%B8%99%E0%B8%AD%E0%B8%A2%E0%B8%B2%E0%B8%81%E0%B8%9C%E0%B8%AD%E0%B8%A1/"
   ),
   new Recipe(
    "m2",
      "ลาบปลาทูน่ากระป๋อง",
      117,
      10,
      [ "100 กรัม", "ตามชอบ", "ตามชอบ", "ตามชอบ", "1 ช้อนโต๊ะ", "ตามชอบ", "1/2 ช้อนโต๊ะ"],
     ["ปลาทูน่ากระป๋อง", "ใบสะระแหน่", "ผักชีฝรั่ง", "ข้าวคั่ว", "น้ำมะนาว", "พริกป่น", "น้ำปลา"],
     ["อาหารแปรรูป", "ผัก", "ผัก", "ผัก", "เครื่องปรุง", "เครื่องปรุง", "เครื่องปรุง"],
      [
        "ใส่ปลาทูน่ากระป๋องลงในชามสำหรับผสม",
         "ปรุงรสด้วยแคร์ช้อยส์สูตรดั้งเดิม น้ำปลา น้ำมะนาว พริกป่นตามชอบ คลุกเคล้าให้เข้ากันดี",
         "ใส่ข้าวคั่ว หอมแดงซอย ผักชีฝรั่งซอย คลุกให้เข้ากันดี",
         "ตักใส่จาน โรยหน้าด้วยใบสะระแหน่ ทานกับผักสดตามชอบ"
     ],
     "https://www.naibann.com/wp-content/uploads/2016/08/tuna-spicy-salad-recipe-cover.jpg",
    "https://carechoicethailand.com/%e0%b8%a5%e0%b8%b2%e0%b8%9a%e0%b8%9b%e0%b8%a5%e0%b8%b2%e0%b8%97%e0%b8%b9%e0%b8%99%e0%b9%88%e0%b8%b2/"
),
//    new Recipe(
//          "ราดหน้ากุ้ง",
//         250,
//         35,
//          [
//             {
//                 "quantity": "50 กรัม",
//                 "ingredient_name": "เส้นหมี่",
//                 "type": "อาหารแปรรูป"
//             },
//             {
//                 "quantity": "100 กรัม",
//                 "ingredient_name": "กุ้ง",
//                 "type": "เนื้อ"
//             },
//             {
//                 "quantity": "40 กรัม",
//                 "ingredient_name": "บล็อคโคลี่",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "40 กรัม",
//                 "ingredient_name": "ดอกกะหล่ำ",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "10 กรัม",
//                 "ingredient_name": "คะน้าฮ่องกง",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "แป้งสาคูแท้",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "ตามใจชอบ",
//                 "ingredient_name": "พริกไทยป่น",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "ซีอิ๊วขาว",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "ผงปรุงรสเห็ดหอม",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ก้อน",
//                 "ingredient_name": "ซุปผักก้อน",
//                 "type": "เครื่องปรุง"
//             }
            
//         ],
//          [
//             "นำน้ำใส่หม้อต้มให้เดือดลวกเส้นหมี่จนสุกนิ่ม ตักขึ้นใส่จานพักไว้",
//             "เอาน้ำใส่หม้อ ใส่ซุปผักก้อน ใส่ผงปรุงรสเห็ดหอม ซีอิ้วขาว ต้มจนน้ำเดือด",
//             "จากนนั้นใส่กุ้ง บล็อคโคลี่ ดอกกะหล่ำ คะน้าฮ่องกง",
//             "ละลายแป้งสาคูแท้กับน้ำเล็กน้อย เทใส่ลงไปในหม้อ คนจนเข้ากันดี",
//             "นำน้ำราดหน้าไปราดบนเส้นหมี่งที่ลวกไว้ โรยพริกไทยป่น เป็นอันเสร็จ"
//         ],
//         "https://i.ytimg.com/vi/reH0KpDTNRw/maxresdefault.jpg",
//         "https://carechoicethailand.com/%e0%b8%a3%e0%b8%b2%e0%b8%94%e0%b8%ab%e0%b8%99%e0%b9%89%e0%b8%b2%e0%b8%81%e0%b8%b8%e0%b9%89%e0%b8%87/"
//    ),
//    new Recipe(
//          "ไข่ตุ๋น",
//         118,
//         20,
//          [
//             {
//                 "quantity": "3 ฟอง",
//                 "ingredient_name": "ไข่ไก่",
//                 "type": "เนื้อ"
//             },
//             {
//                 "quantity": "150 กรัม",
//                 "ingredient_name": "อกไก่",
//                 "type": "เนื้อ"
//             },
//             {
//                 "quantity": "75 กรัม",
//                 "ingredient_name": "กุ้ง",
//                 "type": "เนื้อ"
//             },
//             {
//                 "quantity": "ตามใจชอบ",
//                 "ingredient_name": "เห็ดหอม",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "50 กรัม",
//                 "ingredient_name": "พริกหวาน 3 สี",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "ซีอิ๊วขาว",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ช้อนชา",
//                 "ingredient_name": "ผงปรุงรส",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "ตามใจชอบ",
//                 "ingredient_name": "พริกไทยป่น",
//                 "type": "เครื่องปรุง"
//             }
//         ],
//          [
//             "ละลายผงปรุงรสกับน้ำสะอาด คนให้ละลายพักไว้",
//             "ตอกไข่ไก่ใส่ภาชนะ ตีให้เข้ากันแล้วใส่อกไก่สับลงไป ตีให้เข้ากันอีกที",
//             "เทน้ำซุปที่เตรียมไว้ลงไป ปรุงรสเพิ่มด้วยซีอิ๊วขาว ใส่พริกหวานเพิ่มสีสัน โรยพริกไทยตามชอบ คนให้ส่วนผสมเข้ากันดี",
//             "เทไข่ลงในภาชนะทนความร้อนแล้วนำไปนึ่ง คอยสังเกตว่าไข่ตุ๋นเริ่มเซตตัวดีแล้ว ให้เปิดฝาหม้อนึ่ง",
//             "วางกุ้งกับเห็ดหอมหั่นชิ้นลงบนหน้าไข่ตุ๋น ปิดฝานึ่งต่อจนไข่ตุ๋นสุกดี เอาขึ้นจากหม้อนึ่งพร้อมทานร้อนๆ"
//         ],
//         "https://d12man5gwydfvl.cloudfront.net/wp-content/uploads/2020/01/shutterstock_1510194374.jpg",
//         "https://carechoicethailand.com/%e0%b9%84%e0%b8%82%e0%b9%88%e0%b8%95%e0%b8%b8%e0%b9%8b%e0%b8%99/"
//    ),
//    new Recipe(
//          "ปูผัดต้นหอม",
//         342,
//         20,
//          [
//             {
//                 "quantity": "150 กรัม",
//                 "ingredient_name": "ปู",
//                 "type": "เนื้อ"
//             },
//             {
//                 "quantity": "100 กรัม",
//                 "ingredient_name": "ต้นหอม",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "กระเทียม",
//                 "type": "ผัก"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "ซอสหอยนางรม",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ช้อนโต๊ะ",
//                 "ingredient_name": "ซีอิ๊วขาว",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ช้อนชา",
//                 "ingredient_name": "ผงปรุงรสเห็ดหอม",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "ตามใจชอบ",
//                 "ingredient_name": "พริกไทยป่น",
//                 "type": "เครื่องปรุง"
//             },
//             {
//                 "quantity": "1 ช้อนชา",
//                 "ingredient_name": "น้ำมันมะกอก",
//                 "type": "เครื่องปรุง"
//             }
//         ],
//          [
//             "ตั้งกระทะใส่น้ำมันมะกอกใส่กระเทียมสับลงไปผัดพอหอม ใส่เนื้อปูแล้วเติมน้ำสะอาดเล็กน้อย",
//             "ปรุงรสด้วยผงปรุงรสเห็ดหอม ซอสหอยนางรม ซีอิ๊วขาว ผัดแค่พอเข้ากัน",
//             "ใส่ต้นหอมหั่นท่อน ผัดให้เข้ากันดีโรยพริกไทยป่นตามชอบ ตักใส่จานพร้อมเสิร์ฟ"
//         ],
//         "https://image.makewebeasy.net/makeweb/0/jKFUCwieZ/lay/%E0%B9%80%E0%B8%99%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%9B%E0%B8%B9%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%95%E0%B9%89%E0%B8%99%E0%B8%AB%E0%B8%AD%E0%B8%A1.jpg",
//         "https://carechoicethailand.com/%e0%b8%9b%e0%b8%b9%e0%b8%9c%e0%b8%b1%e0%b8%94%e0%b8%95%e0%b9%89%e0%b8%99%e0%b8%ab%e0%b8%ad%e0%b8%a1/"
//    )
]